app/controllers/products_controller.rb

  def create
  	@product = Product.new(product_params)

  	if @product.save
---
INSERT INTO "products" ("created_at", "description", "name", "price_in_cents", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 11 Nov 2013 21:28:11 UTC +00:00], ["description", "Test"], ["name", "Test"], ["price_in_cents", 2], ["updated_at", Mon, 11 Nov 2013 21:28:11 UTC +00:00]]

  def update
    @product = Product.find(params[:id])

    if @product.update_attributes(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = 7  [["name", "ok"], ["updated_at", Wed, 13 Nov 2013 20:40:34 UTC +00:00]]